---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.IndexTriangle.GetSizeInShortInts
source: html/dc5a70da-cd62-695d-65fd-e49f867ecf72.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexTriangle.GetSizeInShortInts Method

Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.

## Syntax (C#)
```csharp
public static int GetSizeInShortInts()
```

## Returns
The number of short integers occupied by the primitive.